
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеЦеныНоменклатуры(АктуальнаяДата, ЭлементНоменклатуры) Экспорт
	Отбор = Новый Структура("Номенклатура", ЭлементНоменклатуры);
	ЗначениеРесурса = РегистрыСведений.ЦеныРеализации.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначениеРесурса.Цена;
	
КонецФункции

#КонецОбласти
