
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	 ФормированиеФИО(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	 ФормированиеФИО(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	 ФормированиеФИО(Элемент);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Функция ФормированиеФИО(Элемент)
	
	ЗнФИО = "";
	
	Если СокрЛП(Объект.Фамилия) <> "" Тогда
		ЗнФИО = ЗнФИО + ТРег(СокрЛП(Объект.Фамилия)) + " ";
	КонецЕсли;
	
	Если СокрЛП(Объект.Имя) <> "" Тогда
		ЗнФИО = ЗнФИО + ВРег(Лев(СокрЛП(Объект.Имя),1)) + ".";
	КонецЕсли;
	
	Если СокрЛП(Объект.Отчество) <> "" Тогда
		ЗнФИО = ЗнФИО + ВРег(Лев(СокрЛП(Объект.Отчество),1)) + ".";
	КонецЕсли;
	
	Объект.Наименование = ЗнФИО;
	
	Возврат Объект.Наименование;	
		
КонецФункции

#КонецОбласти
