
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСуммуВСтроке(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСуммуВСтроке(СтрокаТЧ);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
