
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыПереченьНоменклатуры
&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	
	РаботаСДокументамиКлиент.РассчитатьСуммуВСтроке(СтрокаТЧ);
			
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСуммуВСтроке(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	СтрокаТЧ.Цена = РаботаСоСправочниками.ЗначениеЦеныНоменклатуры(Объект.Дата, СтрокаТЧ.Номенклатура);
	РаботаСДокументамиКлиент.РассчитатьСуммуВСтроке(СтрокаТЧ);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

